/*   три статических метода для работы с двумерным массивом:
1) initArray() - инициализирует двумерный массив случайными числами от 0 до 10;
2) printArray() - выводит двумерный массив на консоль в виде таблицы (элементы строках отделяются знаками табуляции, и знак табуляции должен быть в конце каждой строки)
3)  deleteRow() - создает новый двумерный массив из исходного (первый параметр метода), удаляя строку, индекс которой передается в качестве второго параметра. Если индекс неверный (отрицательный или больше последнего индекса строк), то ничего не происходит.
В методе main() вводятся четыре целых числа: количество строк и количество столбцов массива, начальное значение генератора случайных чисел и индекс строки для удаления.
Двумерный массив создается и выводится в виде таблицы. Затем выводится новый массив*/

